nguyentri/da-pac/svd/DA14580.svd
        <register>
          <name>BLE_RWBTLECNTL_REG</name>
          <description>BLE Control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>MASTER_SOFT_RST</name>
              <description>Reset the complete system except registers and timing generator, when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MASTER_TGSOFT_RST</name>
              <description>Reset the timing generator, when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SOFT_RST</name>
              <description>Reset the complete register block, when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFTEST_ABORT</name>
              <description>Abort the current RF Testing defined as per CS-FORMAT when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0.
Note that when RFTEST_ABORT is requested.
1) In case of infinite Tx, the Packet Controller FSM stops at the end of the current byte in process, and processes accordingly the packet CRC.
2) In case of Infinite Rx, the Packet Controller FSM either stops as the end of the current Packet reception (if Access address has been detected), or simply stop the processing switching off the RF. </description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVERT_ABORT</name>
              <description>Abort the current Advertising event when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_ABORT</name>
              <description>Abort the current scan window when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MD_DSB</name>
              <description>0: Normal operation of MD bits management
1: Allow a single Tx/Rx exchange whatever the MD bits are </description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SN_DSB</name>
              <description>0: Normal operation of Sequence number
1: Sequence Number Management disabled:
value forced by SW from Tx Descriptor
value ignored in Rx, meaning that no SN error reported. </description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NESN_DSB</name>
              <description>0: Normal operation of Sequence number
1: Sequence Number Management disabled:
value forced by SW from Tx Descriptor
value ignored in Rx, meaning that no SN error reported. </description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPT_DSB</name>
              <description>0: Normal operation. Encryption / Decryption enabled.
1: Encryption / Decryption disabled.
Note that if CS-CRYPT_EN is set, then MIC is generated, and only data encryption is disabled, meaning data sent are plain data. </description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WHIT_DSB</name>
              <description>0: Normal operation. Whitening enabled.
1: Whitening disabled. </description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_DSB</name>
              <description>0: Normal operation. CRC removed from data stream.
1: CRC stripping disabled on Rx packets, CRC replaced by 0x000 in Tx </description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOP_REMAP_DSB</name>
              <description>0: Normal operation. Frequency Hopping Remapping algorithm enabled.
1: Frequency Hopping Remapping algorithm disabled </description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXWINOFFSEL</name>
              <description>Applicable only if device is in Initiator mode
0: Window Offset field in CONNECT_REQ comes from Tx Data Buffer
1: Window Offset field in CONNECT_REQ comes from Event Controller processing and is replaced in real time by Packet Controller </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDESCPTRSEL</name>
              <description>0: Selects Rx Descriptor Pointer value from Control Structure
1: Selects Rx Descriptor Pointer value from CURRENTRXDESCPTR register </description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVERRFILT_EN</name>
              <description>Advertising Channels Error Filtering Enable control
0: BLE Core reports all errors to BLE Software
1: BLE Core reports only correctly received packet, without error to BLE Software </description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLSYNC_EN</name>
              <description>0: WLAN synchronization pulse generation disabled
1: WLAN synchronization pulse generation enabled </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWBLE_EN</name>
              <description>0: Disable BLE Core Exchange Table pre-fetch mechanism.
1: Enable BLE Core Exchange table pre-fetch mechanism. </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXWINSZDEF</name>
              <description>Default Rx Window size in us. Used when device
a) is master connected
b) performs its second receipt.
0 is not a valid value. Recommended value is 10. </description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCERR</name>
              <description>Indicates the maximum number of errors allowed to recognize the synchronization word. </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_RWBTLECONF_REG</name>
          <description>Configuration register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0e080017</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>ADD_WIDTH</name>
              <description>Value of the BLE_ADDRESS_WIDTH parameter converted into binary. </description>
              <bitRange>[29:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RFIF</name>
              <description>Supported radio interfaces.
0001000: on-chip radio
others: reserved </description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_SEL</name>
              <description>Operating Frequency (in MHz).
This field is a copy of the BLE_CNTL2_REG[BLE_CLK_SEL] value. </description>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMMODE</name>
              <description>0: BLE Core is used as a standalone BLE device
1: BLE Core is used in a Dual Mode device </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTMODE</name>
              <description>0: Interrupts are edge level generated, i.e pulse.
1: Interrupts are trigger level generated, i.e stays active at 1 till acknowledgement </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WLAN</name>
              <description>0: WLAN Coexistence mechanism not present
1: WLAN Coexistence mechanism present </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USEDBG</name>
              <description>0: Diagnostic port not instantiated
1: Diagnostic port instantiated </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USECRYPT</name>
              <description>0: Encryption block not present
1: Encryption block present </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSWIDTH</name>
              <description>Processor bus width:
0: 16 bits
1: 32 bits </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_RXMICVAL_REG</name>
          <description>AES / CCM plain MIC value</description>
          <addressOffset>0x000000dc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>RXMICVAL</name>
              <description>AES / CCM plain MIC value. Valid on BLE_CRYPT_IRQ interrupt (even masked) </description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_SAMPLECLK_REG</name>
          <description>Samples the Base Time Counter</description>
          <addressOffset>0x000000fc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>SAMP</name>
              <description>Writing a 1 samples the Base Time Counter value in BASETIMECNT register. Resets at 0 when action is performed. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_SWPROFILING_REG</name>
          <description>Software Profiling register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>SWPROFVAL</name>
              <description>Software Profiling register: used by BLE Software for profiling purpose: this value is copied on Diagnostic port </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_TIMGENCNTL_REG</name>
          <description>Timing Generator Register</description>
          <addressOffset>0x000000f0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PREFTECH_TIME</name>
              <description>Defines Exchange Table pre-fetch instant in us </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_TXMICVAL_REG</name>
          <description>AES / CCM plain MIC value</description>
          <addressOffset>0x000000d8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>TXMICVAL</name>
              <description>AES / CCM plain MIC value. Valid on BLE_CRYPT_IRQ interrupt (even masked) </description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_VERSION_REG</name>
          <description>Version register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>TYP</name>
              <description>BLE Core Type - 0x6 means BT4.0 (i.e correspond LL version assigned number) </description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REL</name>
              <description>BLE Core version - Major release number.(Correspond to FS v1.11) </description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UPG</name>
              <description>BLE Core upgrade - Upgrade number. (Correspond to FS v1.11) </description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUILD</name>
              <description>BLE Core Build - Build number </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_WLNBDEV_REG</name>
          <description>Devices in white list</description>
          <addressOffset>0x000000b8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>NBPRIVDEV</name>
              <description>Number of private devices in the white list. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NBPUBDEV</name>
              <description>Number of public devices in the white list. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_WLPRIVADDPTR_REG</name>
          <description>Start address of private devices list</description>
          <addressOffset>0x000000b4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>WLPRIVADDPTR</name>
              <description>Start address pointer of the private devices white list. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_WLPUBADDPTR_REG</name>
          <description>Start address of public devices list</description>
          <addressOffset>0x000000b0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>WLPUBADDPTR</name>
              <description>Start address pointer of the public devices white list. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
