nguyentri/da-pac/svd/DA14580.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CHIP_VERSION</name>
      <version>1.0</version>
      <description>CHIP_VERSION registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50003200</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>5</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIP_ID1_REG</name>
          <description>Chip identification register 1.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000035</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_ID1</name>
              <description>First character of device type '580' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_ID2_REG</name>
          <description>Chip identification register 2.</description>
          <addressOffset>0x00000001</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000038</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_ID2</name>
              <description>Second character of device type '580' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_ID3_REG</name>
          <description>Chip identification register 3.</description>
          <addressOffset>0x00000002</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_ID3</name>
              <description>Third character of device type '580' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_REVISION_REG</name>
          <description>Chip revision register.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000041</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>REVISION_ID</name>
              <description>Chip version, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_SWC_REG</name>
          <description>Software compatibility register.</description>
          <addressOffset>0x00000003</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_SWC</name>
              <description>SoftWare Compatibility code.
Integer (default = 0) which is incremented if a silicon change has impact on the CPU Firmware.
Can be used by software developers to write silicon revision dependent code. </description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>crg580_dcdc_nl01</name>
      <version>1.0</version>
      <description>crg580_dcdc_nl01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50000080</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DCDC_CTRL2_REG</name>
          <description>DCDC second control register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00008c20</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DCDC_VOLT_LEV</name>
              <description>Nominal output voltage of the DCDC-converter.
VDCDC = 1.2V + N*25mV </description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_VBAT3V_LEV</name>
              <description>Nominal VBAT3V output voltage of the boost converter.
000 ... 011 = 1.8V + N*25mV
100 = 2.4V
101 = 2.5V
110 = 2.62V
111 = 2.76V
(Note: MSB is automatically on if the OTP LDO is enabled.) </description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_TON</name>
              <description>This defines the minimum on-time of the comparators. For buck-mode use 0x2, for boost-mode use 0x1</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_CUR_LIM</name>
              <description>Current limit in the switches of the DCDC-converter (approximate values):
N x 10mA </description>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_AUTO_CAL</name>
              <description>Control of the automatic calibration of the DCDC-converter. For Buck-mode use 0x1, for Boost-mode use 0x6.
Automatic calibration is disabled by setting 0x0 </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC_CTRL3_REG</name>
          <description>DCDC thirth control register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000015</resetValue>
          <resetMask>0x0000001f</resetMask>
          <fields>
            <field>
              <name>DCDC_TIMEOUT</name>
              <description>timeout for the idle state to check voltage</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_IDLE_CLK</name>
              <description>Clock used as trigger for the idle state to check voltage.
(Note: when no 16 MHz oscillator is active, the 32 kHz oscillator will be used as trigger independent of the setting below:)
00 = 16 MHz
01 = 4 MHz
10 = 1 MHz
11 = 250 kHz </description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUCK_ENABLE</name>
              <description>Enables the buck converter when the device becomes active and VBAT1V is connected to GND. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC_CTRL_REG</name>
          <description>DCDC control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000000c</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DCDC_TUNE</name>
              <description>Tune-bits to compensate for parasitic resistance in the current sense circuit of the DCDC-converter. </description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_DRIVE_OSW</name>
              <description>Drive level of the switch between SWITCH and VDCDC.
00 = 100 percent
01 = 66 percent
10 = 33 percent
11 = off </description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_DRIVE_PSW</name>
              <description>Drive level of the switch between SWITCH and VBAT3V.
00 = 100 percent
01 = 66 percent
10 = 33 percent
11 = off </description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_DRIVE_NSW</name>
              <description>Drive level of the switch between SWITCH and GROUND.
00 = 100 percent
01 = 66 percent
10 = 33 percent
11 = off </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_MODE</name>
              <description>Testmodes, keep 000. </description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_VBAT1V_LEV</name>
              <description>If VBAT1V is below this level, the boost converter will be disabled:
110 = 0.6V
101 = 0.8V
011 = 1.0V
111 = 0V (always OK) </description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
