nguyentri/da-pac/svd/DA14580.svd
        <register>
          <name>SYS_CTRL_REG</name>
          <description>System Control register</description>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000083ff</resetMask>
          <fields>
            <field>
              <name>SW_RESET</name>
              <description>Writing a '1' to this bit will reset the device, except for:
SYS_CTRL_REG
CLK_FREQ_TRIM_REG
... </description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMEOUT_DISABLE</name>
              <description>Disables timeout in Power statemachine. By default, the statemachine continues if after 2 ms the blocks are not started up. This can be read back from
ANA_STATUS_REG. </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUGGER_ENABLE</name>
              <description>Enable the debugger. This bit is set by the booter according to the OTP header. If not set, the SWDIO and SW_CLK can be used as gpio ports. </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OTPC_RESET_REQ</name>
              <description>Reset request for the OTP controller. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_LATCH_EN</name>
              <description>Latches the control signals of the pads for state retention in powerdown mode.
0: Control signals are retained
1: Latch is transparant, pad can be recontrolled </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_COPY</name>
              <description>Enables OTP to SysRAM copy action after waking up PD_SYS </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK32_SOURCE</name>
              <description>Sets the clock source of the 32 kHz clock
0 = RC-oscillator
1 = 32 kHz crystal oscillator </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RET_SYSRAM</name>
              <description>Sets the development phase mode.
If this bit is set, the SysRAM cell will not power gated during sleep (extended sleep).
No copy action to SysRAM is done when the system wakes up.
For emulating startup time, the OTP_COPY bit still needs to be set. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REMAP_ADR0</name>
              <description>Controls which memory is located at address 0x0000 for execution.
0x0: ROM
0x1: OTP
0x2: SysRAM
0x3: RetRAM</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_STAT_REG</name>
          <description>System status register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000055</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>XTAL16_SETTLED</name>
              <description>Indicates that XTAL16 has had &gt; 2 ms of settle time </description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL16_TRIM_READY</name>
              <description>Indicates that XTAL trimming mechanism is ready, i.e. the trimming equals CLK_FREQ_TRIM_REG. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_IS_UP</name>
              <description>Indicates that PD_DBG is functional </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_IS_DOWN</name>
              <description>Indicates that PD_DBG is in power down </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_IS_UP</name>
              <description>Indicates that PD_PER is functional </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_IS_DOWN</name>
              <description>Indicates that PD_PER is in power down </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RAD_IS_UP</name>
              <description>Indicates that PD_RAD is functional </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RAD_IS_DOWN</name>
              <description>Indicates that PD_RAD is in power down </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_CTRL_REG</name>
          <description>Control trimming of the XTAL16M</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x000000a2</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>TRIM_TIME</name>
              <description>Defines the delay between XTAL16M enable and applying the CLK_FREQ_TRIM_REG in steps of 250 us.
0x0: apply directly
0x1: wait between 0 and 250 us
0x2: wait between 250 us and 500 us
etc.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETTLE_TIME</name>
              <description>Defines the delay between applying CLK_FREQ_TRIM_REG and XTAL16_SETTLED in steps of 250 us.
0x0: XTAL16_SETTLED is set direcly
0x1: wait between 0 and 250 us
0x2: wait between 250 us and 500 us
etc.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
