nguyentri/da-pac/svd/DA14580.svd
        <register>
          <name>P1_SET_DATA_REG</name>
          <description>P1 Set port pins register</description>
          <addressOffset>0x00000022</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P1_SET</name>
              <description>Writing a 1 to P1[y] sets P1[y] to 1. Writing 0 is discarded;
Reading returns 0 </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P20_MODE_REG</name>
          <description>P20 Mode Register</description>
          <addressOffset>0x00000046</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P21_MODE_REG</name>
          <description>P21 Mode Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P22_MODE_REG</name>
          <description>P22 Mode Register</description>
          <addressOffset>0x0000004a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P23_MODE_REG</name>
          <description>P23 Mode Register</description>
          <addressOffset>0x0000004c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P24_MODE_REG</name>
          <description>P24 Mode Register</description>
          <addressOffset>0x0000004e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P25_MODE_REG</name>
          <description>P25 Mode Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P26_MODE_REG</name>
          <description>P26 Mode Register</description>
          <addressOffset>0x00000052</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P27_MODE_REG</name>
          <description>P27 Mode Register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P28_MODE_REG</name>
          <description>P28 Mode Register</description>
          <addressOffset>0x00000056</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P29_MODE_REG</name>
          <description>P29 Mode Register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In analog mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2_DATA_REG</name>
          <description>P2 Data input / output register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P2_DATA</name>
              <description>Set P2 output register when written; Returns the value of P2 port when read </description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2_PADPWR_CTRL_REG</name>
          <description>Port 2 Output Power Control Register</description>
          <addressOffset>0x00000072</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P2_OUT_CTRL</name>
              <description>1 = P2_x port output is powered by the 1 V rail
0 = P2_x port output is powered by the 3 V rail
bit 0 controls the power of P2[0],
bit 9 controls the power of P2[9],</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2_RESET_DATA_REG</name>
          <description>P2 Reset port pins register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P2_RESET</name>
              <description>Writing a 1 to P2[y] sets P2[y] to 0. Writing 0 is discarded;
Reading returns 0 </description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2_SET_DATA_REG</name>
          <description>P2 Set port pins register</description>
          <addressOffset>0x00000042</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P2_SET</name>
              <description>Writing a 1 to P2[y] sets P2[y] to 1. Writing 0 is discarded;
Reading returns 0 </description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P30_MODE_REG</name>
          <description>P30 Mode Register</description>
          <addressOffset>0x00000086</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P31_MODE_REG</name>
          <description>P31 Mode Register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P32_MODE_REG</name>
          <description>P32 Mode Register</description>
          <addressOffset>0x0000008a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P33_MODE_REG</name>
          <description>P33 Mode Register</description>
          <addressOffset>0x0000008c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P34_MODE_REG</name>
          <description>P34 Mode Register</description>
          <addressOffset>0x0000008e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P35_MODE_REG</name>
          <description>P35 Mode Register</description>
          <addressOffset>0x00000090</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P36_MODE_REG</name>
          <description>P36 Mode Register</description>
          <addressOffset>0x00000092</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P37_MODE_REG</name>
          <description>P37 Mode Register</description>
          <addressOffset>0x00000094</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3_DATA_REG</name>
          <description>P3 Data input / output register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P3_DATA</name>
              <description>Set P3 output register when written; Returns the value of P3 port when read </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3_PADPWR_CTRL_REG</name>
          <description>Port 3 Output Power Control Register</description>
          <addressOffset>0x00000074</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P3_OUT_CTRL</name>
              <description>1 = P3_x port output is powered by the 1 V rail
0 = P3_x port output is powered by the 3 V rail
bit 0 controls the power of P3[0],
bit 7 controls the power of P3[7],</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3_RESET_DATA_REG</name>
          <description>P3 Reset port pins register</description>
          <addressOffset>0x00000084</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P3_RESET</name>
              <description>Writing a 1 to P0[y] sets P0[y] to 0. Writing 0 is discarded;
Reading returns 0</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3_SET_DATA_REG</name>
          <description>P3 Set port pins register</description>
          <addressOffset>0x00000082</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P3_SET</name>
              <description>Writing a 1 to P3[y] sets P3[y] to 1. Writing 0 is discarded; Reading returns 0</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
