nguyentri/da-pac/svd/DA14580.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>quadec580_gr01</name>
      <version>1.0</version>
      <description>quadec580_gr01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50000200</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>12</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>QDEC_CLOCKDIV_REG</name>
          <description>Clock divider register</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003ff</resetMask>
          <fields>
            <field>
              <name>clock_divider</name>
              <description>Contains the number of the input clock cycles minus one, that are required to generate one logic clock cycle. </description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDEC_CTRL2_REG</name>
          <description>Quad Decoder control register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>CHZ_PORT_SEL</name>
              <description>Defines which GPIOs are mapped on Channel Z
0: none
1: P0[0] -&gt; CHZ_A, P0[1] -&gt; CHZ_B
2: P0[2] -&gt; CHZ_A, P0[3] -&gt; CHZ_B
3: P0[4] -&gt; CHZ_A, P0[5] -&gt; CHZ_B
4: P0[6] -&gt; CHZ_A, P0[7] -&gt; CHZ_B
5: P1[0] -&gt; CHZ_A, P1[1] -&gt; CHZ_B
6: P1[2] -&gt; CHZ_A, P1[3] -&gt; CHZ_B
7: P2[3] -&gt; CHZ_A, P2[4] -&gt; CHZ_B
8: P2[5] -&gt; CHZ_A, P2[6] -&gt; CHZ_B
9: P2[7] -&gt; CHZ_A, P2[8] -&gt; CHZ_B
10: P2[9] -&gt; CHZ_A, P2[0] -&gt; CHZ_B
11..15: None</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHY_PORT_SEL</name>
              <description>Defines which GPIOs are mapped on Channel Y
0: none
1: P0[0] -&gt; CHY_A, P0[1] -&gt; CHY_B
2: P0[2] -&gt; CHY_A, P0[3] -&gt; CHY_B
3: P0[4] -&gt; CHY_A, P0[5] -&gt; CHY_B
4: P0[6] -&gt; CHY_A, P0[7] -&gt; CHY_B
5: P1[0] -&gt; CHY_A, P1[1] -&gt; CHY_B
6: P1[2] -&gt; CHY_A, P1[3] -&gt; CHY_B
7: P2[3] -&gt; CHY_A, P2[4] -&gt; CHY_B
8: P2[5] -&gt; CHY_A, P2[6] -&gt; CHY_B
9: P2[7] -&gt; CHY_A, P2[8] -&gt; CHY_B
10: P2[9] -&gt; CHY_A, P2[0] -&gt; CHY_B
11..15: None</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHX_PORT_SEL</name>
              <description>Defines which GPIOs are mapped on Channel X
0: none
1: P0[0] -&gt; CHX_A, P0[1] -&gt; CHX_B
2: P0[2] -&gt; CHX_A, P0[3] -&gt; CHX_B
3: P0[4] -&gt; CHX_A, P0[5] -&gt; CHX_B
4: P0[6] -&gt; CHX_A, P0[7] -&gt; CHX_B
5: P1[0] -&gt; CHX_A, P1[1] -&gt; CHX_B
6: P1[2] -&gt; CHX_A, P1[3] -&gt; CHX_B
7: P2[3] -&gt; CHX_A, P2[4] -&gt; CHX_B
8: P2[5] -&gt; CHX_A, P2[6] -&gt; CHX_B
9: P2[7] -&gt; CHX_A, P2[8] -&gt; CHX_B
10: P2[9] -&gt; CHX_A, P2[0] -&gt; CHX_B
11..15: None</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDEC_CTRL_REG</name>
          <description>Quad Decoder control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>QD_IRQ_THRES</name>
              <description>The number of events on either counter (X or Y) that need to be reached before an interrupt is generated. If 0 is written, then threshold is considered to be 1. </description>
              <bitRange>[9:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QD_IRQ_STATUS</name>
              <description>Interrupt Status. If 1 an interrupt has occured. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QD_IRQ_CLR</name>
              <description>Writing 1 to this bit clears the interrupt. This bit is autocleared </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QD_IRQ_MASK</name>
              <description>0: interrupt is masked
1: interrupt is enabled </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDEC_XCNT_REG</name>
          <description>Counter value of the X Axis</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>X_counter</name>
              <description>Contains a signed value of the events. Zero when channel is disabled </description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDEC_YCNT_REG</name>
          <description>Counter value of the Y Axis</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>Y_counter</name>
              <description>Contains a signed value of the events. Zero when channel is disabled</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDEC_ZCNT_REG</name>
          <description>Z_counter</description>
          <addressOffset>0x0000000a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>Z_counter</name>
              <description>Contains a signed value of the events. Zero when channel is disabled</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
