nguyentri/da-pac/svd/DA14580.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>tmr580_nl01</name>
      <version>1.0</version>
      <description>tmr580_nl01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50003400</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>18</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PWM2_DUTY_CYCLE</name>
          <description>Duty Cycle for PWM2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003fff</resetMask>
          <fields>
            <field>
              <name>DUTY_CYCLE</name>
              <description>duty cycle for PWM </description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM3_DUTY_CYCLE</name>
          <description>Duty Cycle for PWM3</description>
          <addressOffset>0x0000000a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003fff</resetMask>
          <fields>
            <field>
              <name>DUTY_CYCLE</name>
              <description>duty cycle for PWM </description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM4_DUTY_CYCLE</name>
          <description>Duty Cycle for PWM4</description>
          <addressOffset>0x0000000c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003fff</resetMask>
          <fields>
            <field>
              <name>DUTY_CYCLE</name>
              <description>duty cycle for PWM </description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0_CTRL_REG</name>
          <description>Timer0 control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PWM_MODE</name>
              <description>0 = PWM signals are '1' during high time.
1 = PWM signals send out the (fast) clock divided by 2 during high time. So it will be in the range of 1 to 8 MHz. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM0_CLK_DIV</name>
              <description>1 = Timer0 uses selected clock frequency as is.
0 = Timer0 uses selected clock frequency divided by 10.
Note that this applies only to the ON-counter.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM0_CLK_SEL</name>
              <description>1 = Timer0 uses 16, 8, 4 or 2 MHz (fast) clock frequency.
0 = Timer0 uses 32 kHz (slow) clock frequency. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM0_CTRL</name>
              <description>0 = Timer0 is off and in reset state.
1 = Timer0 is running. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0_ON_REG</name>
          <description>Timer0 on control register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>TIM0_ON</name>
              <description>Timer0 On reload value:
If read the actual counter value ON_CNTer is returned </description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0_RELOAD_M_REG</name>
          <description>16 bits reload value for Timer0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>TIM0_M</name>
              <description>Timer0 'high' reload valueIf read the actual counter value T0_CNTer is returned </description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0_RELOAD_N_REG</name>
          <description>16 bits reload value for Timer0</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>TIM0_N</name>
              <description>Timer0 'low' reload value:
If read the actual counter value T0_CNTer is returned </description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIPLE_PWM_CTRL_REG</name>
          <description>PWM 2 3 4 Control</description>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>HW_PAUSE_EN</name>
              <description>'1' = HW can pause PWM 2,3,4 </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_PAUSE_EN</name>
              <description>'1' = PWM 2 3 4 is paused </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPLE_PWM_ENABLE</name>
              <description>'1' = PWM 2 3 4 is enabled </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIPLE_PWM_FREQUENCY</name>
          <description>Frequency for PWM 2,3 and 4</description>
          <addressOffset>0x0000000e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003fff</resetMask>
          <fields>
            <field>
              <name>FREQ</name>
              <description>Freq for PWM 2 3 4 </description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
